vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/NXP/LPC315x/LPC315x.h
/******************************************************************************/
/*  This file is part of the uVision/ARM development tools                    */
/*  Copyright KEIL ELEKTRONIK GmbH 2002-2009                                  */
/******************************************************************************/
/*                                                                            */
/*  LPC315x.h: Header file for NXP LPC315x Device Series                      */
/*                                                                            */
/******************************************************************************/

#ifndef __LPC315x_H
#define __LPC315x_H

#include "lpc315x_ad.h"
#include "lpc315x_adc10b.h"
#include "lpc315x_adc10b_driver.h"
#include "lpc315x_analog.h"
#include "lpc315x_cgu.h"
#include "lpc315x_cgu_driver.h"
#include "lpc315x_cgu_switchbox.h"
#include "lpc315x_chip.h"
#include "lpc315x_crc_driver.h"
#include "lpc315x_dma_driver.h"
#include "lpc315x_dmac.h"
#include "lpc315x_evt_driver.h"
#include "lpc315x_evt_router.h"
#include "lpc315x_i2c.h"
#include "lpc315x_i2c_driver.h"
#include "lpc315x_i2s.h"
#include "lpc315x_i2s_driver.h"
#include "lpc315x_intc.h"
#include "lpc315x_intc_driver.h"
#include "lpc315x_ioconf.h"
#include "lpc315x_ioconf_driver.h"
#include "lpc315x_ipint.h"
#include "lpc315x_ipint_driver.h"
#include "lpc315x_lcdc.h"
#include "lpc315x_mci.h"
#include "lpc315x_mci_driver.h"
#include "lpc315x_mpmc.h"
#include "lpc315x_nand_driver.h"
#include "lpc315x_nandc.h"
#include "lpc315x_otp.h"
#include "lpc315x_otp_driver.h"
#include "lpc315x_psu_driver.h"
#include "lpc315x_pwm.h"
#include "lpc315x_pwm_driver.h"
#include "lpc315x_rng.h"
#include "lpc315x_rtc.h"
#include "lpc315x_rtc_driver.h"
#include "lpc315x_spi.h"
#include "lpc315x_spi_driver.h"
#include "lpc315x_sysreg.h"
#include "lpc315x_timer.h"
#include "lpc315x_timer_driver.h"
#include "lpc315x_uart.h"
#include "lpc315x_uart_driver.h"
#include "lpc315x_usbotg.h"
#include "lpc315x_wdt.h"
#include "lpc315x_wdt_driver.h"


#endif /* __LPC315x_H */
